{
  "timestamp": "2025-10-28T19:55:45.786567",
  "cv_text": "Anas Aouini \r\nICT Engineering Student \r\nanas.aouini@supcom.tn | +216 58934007 | linkedin.com/in/anas-aouini \r\nProfessional Summary \r\nFirst-year ICT Engineering student at Sup'Com with a passion for machine learning, \r\nnatural language processing, and web development. Led the development of the \r\nIndabaX Tunisia 2025 website as technical manager and placed 7th in an \r\nNLP-focused AI Anomaly Hackathon. Seeking a summer internship to apply \r\nexpertise in C++, SQL, and Python to innovative projects. \r\nEducation \r\nEngineering Cycle in Information and Communication Technologies \r\nTunis, Tunisia \r\nSup'Com (École Supérieure des Communications de Tunis) \r\n09/2024 - Present \r\nPreparatory Cycle for Engineering Studies \r\nNabeul, Tunisia \r\nIPEIN - Institut Préparatoire aux Études d'Ingénieur de Nabeul \r\n09/2022 - 06/2024 \r\n● Focused on mathematics, physics, and foundational engineering principles \r\nSkills \r\n● Technical Skills: HTML, CSS, JavaScript, Flask, Python, C++, SQL Databases, \r\nMachine Learning (Beginner), Deep Learning (Beginner) \r\n● Soft Skills: Problem-Solving, Adaptability, Team Collaboration \r\n● Languages: Arabic (Native), English (Fluent), French (Fluent), German \r\n(Beginner) \r\nSelected Projects \r\nIndabaX Tunisia 2025 Website 2024-2025 \r\n● Served as technical manager, single-handedly developing a responsive \r\nwebsite (indabax-tunisia.com/2025) using HTML, CSS, and JavaScript. \r\n● Implemented SEO best practices to enhance visibility and ensured \r\ncross-device compatibility. \r\nCompetitions & Hackathons \r\nAI Anomaly Hackathon, GDG Sup’Com \r\nTunis, Tunisia, 2024 \r\n● Participated in first-ever NLP-focused hackathon, collaborating on a natural \r\nlanguage processing project using Python, with team placing 7th out of 18 \r\nteams. \r\n● Demonstrated teamwork and foundational NLP skills in a competitive setting. \r\nLeague of Coders, ENIT \r\nTunis, Tunisia, 2024 \r\n● Competed in a competitive programming contest, solving algorithmic \r\nchallenges using C++ and Python. \r\n● Enhanced problem-solving and coding efficiency under time constraints. ",
  "job_description": "Server-Side Development\t- Design, develop, and maintain server-side applications and microservices using chosen technologies (e.g., Node.js, Python/Django, Java/Spring Boot).\r\n- Build, integrate, and manage RESTful or GraphQL APIs for use by frontend and mobile applications.\r\n- Implement business logic and complex workflows on the server.\r\nDatabase Management\t- Design and optimize database schemas (SQL like PostgreSQL, MySQL, or NoSQL like MongoDB, Cassandra).\r\n- Ensure data integrity, security, and optimal query performance.\r\nSystem Architecture & Scalability\t- Design and implement scalable and high-performance systems to handle high traffic and data volume.\r\n- Implement caching mechanisms (e.g., Redis) to improve application speed and efficiency.",
  "statistics": {
    "total_characters": 2061,
    "word_count": 260,
    "line_count": 43
  },
  "file_info": {
    "source": "raw_text"
  }
}