{
  "timestamp": "2025-10-31T16:15:42.880465",
  "cv_text": "Edam Taktek\nBackend Developer | Python & Java | Flask • Spring Boot • PoﬆgreSQL\n+216 29858535\nedam.taktek65@gmail.com\nSfax, Route Saltania\ngithub.com/Adeeem2\nwww.linkedin.com/in/edam-taktek-\n5b9b27338/\nfacebook.com/edam.AdouWe\nSummary\nResourceful Developer with hands-\non experience in backend\ndevelopment and data automation.\nSkilled in Python, Flask, Java, and\nweb scraping. Currently working on\nreal-world projects involving\nDocker, PoﬆgreSQL, and APIs.\nEducation\nEngineering Degree in Data\nScience – 1ﬆ Year\nNational School of Electronics and\nTelecommunications of Sfax\n(ENET'Com)\nsept., 2024 - Present\nBaccalaureate in Mathematics\nLycée Med Ali Sfax\nsept., 2018 - juin, 2022\nTechnical Skills\nJavaScript, Python, Web Services, C,\nHTML5, CSS, SQL, User Interface,\nAssembly, Docker, Linux, Git\nSoft Skills\nCollaboration, Problem-solving,\nCommunication, Time management,\nAdditional Skills\nAdobe After Effects, Adobe Photoshop,\nBasic penetration teﬆing\nLanguages\nEnglish, Frensh, Arabic\nCertiﬁcations\nMicrosoft Certiﬁed: Azure AI\nFundamentals\nWork Experience\nFreelance Python Developer\nmars, 2025 - Present\nBackend Developer\nDeveloped web scraping scripts using BeautifulSoup, Playwright and\nCelery to extract and process ﬆructured data from various websites\nBuilt and deployed a Flask web app to track subreddit activity using the\nReddit API, PoﬆgreSQL, and Docker\nWorked with clients to automate repetitive tasks, improve data collection\nefﬁciency, and deliver clean, usable datasets\nSonotrak\naoût, 2024 - sept., 2024\nTicketing Agent\nSonotrak is the main transportation company operating ferry services be-\ntween Sfax and the Kerkennah Island.\nManaged daily ticket sales and cuﬆomer service at the ferry terminal\nbetween Sfax and Kerkennah\nIdentiﬁed software limitations in the company’s outdated ticketing syﬆem\n(from 2006), including lack of refund options\nProposed a digital transformation plan involving modern software\nsolutions to improve ticketing ﬂexibility and user experience\nProjects\nSubreddit Activity Tracker\nA web app that tracks and ﬆores activity from speciﬁed subreddits using\nReddit’s API, with background tasks via Celery.\nDesigned and built a Flask web application to monitor poﬆ frequency and\nuser activity across selected subreddits in real time\nIntegrated Reddit API with PoﬆgreSQL for ﬆructured data ﬆorage and\nquerying\nDeployed background tasks using Celery and Docker to automate\nperiodic data collection\nFounder – Cuﬆom T-Shirt Brand ( Tuno )\njuin, 2023 - sept., 2024\nhttps://www.inﬆagram.com/tun00x\nCreated and launched a small clothing brand focused on personalized t-\nshirt designs\nManaged the entire process from concept, design (using Photoshop), and\nsourcing, to cuﬆomer delivery",
  "job_description": "À propos de l’offre d’emploi\r\nResponsibilities\r\n\r\nByteDance Networking brings together innovative ideas and technologies from network architecture, software defined networking (SDN), network virtualization, switch software and hardware co-design, and high-speed networking, to create hyperscale data-center networking solutions that power several of the most popular apps of the world such as Douyin and TikTok which serve hundreds of millions of users around the globe.\r\n\r\nByteDance Networking is responsible for designing, building, and operating the global, intelligent network infrastructure to meet the requirements of high availability, scalability, and high-performance. By joining this team, you will gain marketable software development and/or network operation experiences in data center networking at massive scale.\r\n\r\nWe are looking for talented individuals to join us for this future position in 2025. As a graduate, you will get unparalleled opportunities for you to kickstart your career, pursue bold ideas and explore limitless growth opportunities. Co-create a future driven by your inspiration with Bytedance.\r\n\r\nSuccessful candidates must be able to commit to one of the following start dates below:\r\n\r\n January 15, 2025\r\n February 5, 2025\r\n March 4, 2025\r\n May 20, 2025\r\n June 17, 2025\r\n July 15, 2025\r\n August 12, 2025\r\nSeptember 3, 2025\r\n\r\n\r\nWe will prioritize candidates who are able to commit to these start dates. Please state your availability and graduation date clearly in your resume.\r\n\r\nApplications will be reviewed on a rolling basis. We encourage you to apply early.\r\n\r\nCandidates can apply for a maximum of TWO positions and will be considered for jobs in the order you applied for. The application limit is applicable to ByteDance and its affiliates' jobs globally.\r\n\r\nResponsibilities:\r\n\r\n Design, implementation and deployment of high-speed network technologies to support AI/LLM applications.\r\n Design and development of platforms/systems for monitoring, analysis and diagnosis of large scale AI/LLM network.\r\n Research and development of high-performance AI communication framework, network protocol stacks, and codesign optimization of host-network-application to improve the scalability, reliability and performance of AI/LLM network.\r\n Building next generation AI network infrastructure supporting large scale heterogeneous network hardware with innovative and deployable solutions.\r\n\r\n\r\nQualifications\r\n\r\nMinimum Qualifications\r\n\r\n Current year or recent PhD graduate with a background in computer science, electronic engineering, network engineering or related fields.\r\n Proficiency in computer network and network programming.\r\n Proficiency in one or several mainstream programming languages, including C/C++, Python, Go and so on.\r\n Be familiar with the latest advances in the area of high-speed network systems, including RDMA, congestion control, AI network optimization and so on.\r\n\r\n\r\nPreferred Qualifications\r\n\r\n Experience in developing high performance communication frameworks(including NCCL, MPI and RPC libraries) is a plus.\r\n Experience in developing software systems for AI network diagnosis and performance optimization is a plus.\r\n\r\n\r\nJob Information\r\n\r\n【For Pay Transparency】Compensation Description (Annually)\r\n\r\nThe base salary range for this position in the selected city is $129960 - $246240 annually.\r\n\r\nCompensation may vary outside of this range depending on a number of factors, including a candidate’s qualifications, skills, competencies and experience, and location. Base pay is one part of the Total Package that is provided to compensate and recognize employees for their work, and this role may be eligible for additional discretionary bonuses/incentives, and restricted stock units.\r\n\r\nBenefits may vary depending on the nature of employment and the country work location. Employees have day one access to medical, dental, and vision insurance, a 401(k) savings plan with company match, paid parental leave, short-term and long-term disability coverage, life insurance, wellbeing benefits, among others. Employees also receive 10 paid holidays per year, 10 paid sick days per year and 17 days of Paid Personal Time (prorated upon hire with increasing accruals by tenure).\r\n\r\nThe Company reserves the right to modify or change these benefits programs at any time, with or without notice.\r\n\r\nFor Los Angeles County (unincorporated) Candidates:\r\n\r\nQualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state, and local laws including the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act. Our company believes that criminal history may have a direct, adverse and negative relationship on the following job duties, potentially resulting in the withdrawal of the conditional offer of employment:\r\n\r\n Interacting and occasionally having unsupervised contact with internal/external clients and/or colleagues;\r\n Appropriately handling and managing confidential information including proprietary and trade secret information and access to information technology systems; and\r\n Exercising sound judgment.\r\n\r\n\r\nAbout Us\r\n\r\nFounded in 2012, ByteDance's mission is to inspire creativity and enrich life. With a suite of more than a dozen products, including TikTok, Lemon8, CapCut and Pico as well as platforms specific to the China market, including Toutiao, Douyin, and Xigua, ByteDance has made it easier and more fun for people to connect with, consume, and create content.\r\n\r\nWhy Join ByteDance\r\n\r\nInspiring creativity is at the core of ByteDance's mission. Our innovative products are built to help people authentically express themselves, discover and connect – and our global, diverse teams make that possible. Together, we create value for our communities, inspire creativity and enrich life - a mission we work towards every day.\r\n\r\nAs ByteDancers, we strive to do great things with great people. We lead with curiosity, humility, and a desire to make impact in a rapidly growing tech company. By constantly iterating and fostering an \"Always Day 1\" mindset, we achieve meaningful breakthroughs for ourselves, our Company, and our users. When we create and grow together, the possibilities are limitless. Join us.\r\n\r\nDiversity & Inclusion\r\n\r\nByteDance is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At ByteDance, our mission is to inspire creativity and enrich life. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.\r\n\r\nReasonable Accommodation\r\n\r\nByteDance is committed to providing reasonable accommodations in our recruitment processes for candidates with disabilities, pregnancy, sincerely held religious beliefs or other reasons protected by applicable laws. If you need assistance or a reasonable accommodation, please reach out to us at https://tinyurl.com/RA-request",
  "statistics": {
    "total_characters": 2714,
    "word_count": 374,
    "line_count": 80
  },
  "file_info": {
    "filename": "ATSresume.pdf",
    "file_size_bytes": 288040,
    "extracted_text_length": 2714
  }
}