{
  "timestamp": "2025-10-29T14:33:18.015267",
  "cv_text": "Étudiant en deuxième année TIC à Sup’Com, motivé par l’innovation technologique et la conception de solutions face\nà des problématiques complexes. Axé sur l’apprentissage continu, je recherche activement des opportunité pour\nrenforcer mes compétences et approfondir mes connaissances.\nEXPÉRIENCES PROFESSIONNELLES\nStage d’été en 5G - Orange Tunisie & IEEE Technical Activities Tunisia Section - Juillet / Août 2025\nMise en place et validation d’un banc d’essai 5G SA (Standalone) avec intégration SIM et gNB.\nPréparation de cas d’usage et démonstrations pour un hackathon 5G.\n__________________________________________________________\nMohamed Ali BEN SALAH\nÉlève Ingénieur à SUP’COM | Télécommunication\nwww.linkedin.com/in/mohamed-ali-bensalah-b2a683218/\n+216 23 123 019\nmohamedali.bensalah@supcom.tn\nGrombalia, Nabeul\n@\nPROJETS\nProjets Éducatifs\nConception d’antennes log-périodiques : Conception, simulation et réalisation d’une antenne log-périodique à large bande, testée avec succès sur\ntoute la gamme de fréquences prévue.\nSystème de minuteur et de chronométrage : Développement d’un minuteur/chronomètre numérique, programmé en VHDL sur FPGA, avec\naffichage précis sur écrans à 7 segments.\nSystème d’authentification en C++ : Création d’un programme console permettant l’inscription et la connexion des utilisateurs, avec gestion des\nmots de passe et des fichiers.\nSystème de gestion des transports publics : Conception d’une base de données MySQL pour gérer véhicules, utilisateurs et billets, avec interface\ngraphique pour faciliter l’utilisation.\nProjets Humanitaires\nProjet PACTE – Initiative éducative et sociale : Participation à un projet humanitaire proposé par l’école, visant à améliorer l’environnement\nscolaire par la création de clubs de robotique et d’art. Animation d’ateliers pour initier les élèves à la robotique et au prototypage, avec la\nréalisation d’exemples pratiques en équipe. Ce projet a permis de promouvoir l’éducation et le travail d’équipe auprès des jeunes.\nValorisation du patrimoine alimentaire à Nabeul : Projet réalisé par l’association Vision des Jeunes Ambitieux, en partenariat avec l’Institut\nFrançais de Tunisie (IFT) et l’Institut Supérieur des Langues de Nabeul (ISLN), pour mettre en valeur le patrimoine alimentaire du gouvernorat de\nNabeul à travers des actions de sensibilisation et de valorisation culturelle.\n__________________________________________________________\nCOMPÉTENCES\nLangages : Français (Courant) , Anglais (Courant) , Arabe (Native).\nProgrammation : Python, C/C++, POO, MATLAB, Langage Assembleur, VHDL.\nDéveloppement web et mobiles : HTML, CSS, JavaScript, PHP.\nModélisation : MySQL, UML.\nSystèmes d’exploitations : Linux Redhat, Windows.\n__________________________________________________________\nÉDUCATION\n2024 - Présent\n2022 - 2024\n\n__________________________________________________________\nEcole Supérieure de Communication de Tunis ( SUP’COM ).\nInstitut préparatoire aux études d'ingénieurs de Nabeul, filière Mathématiques-Physiques.\nVIE ASSOCIATIVE ET CLUB\n2024 - Présent\n\n\n2022 - 2025\n2021 - 2022\n2020 - 2021\nVice-Président à IEEE RAS chapter SUPCOM.\nMembre of Google Developer Groups SUPCOM\nMembre en commitée d’organisation de forum SUPCOM édition 25.\n.\nTrésorier à Vision des Jeunes Ambitieux .\nVice-Président à Vision des Jeunes Ambitieux.\nMembre actif chez Vision des Jeunes Ambitieux.\n__________________________________________________________\nCERTIFICATIONS\nDiplôme de la Musique Arabe\nCertificat de traitement de signal et de l’image MATLAB.\nCertificat Les Fondamentaux de Deep Learning NVIDIA.\nCertificat Intelligence artificielle générative avec des modèles de diffusion NVIDIA.\nCertificat Créez votre premier chatbot basé sur l’IA générative TALAN.\nCertificat CCNA-1.\nRed Hat System Administration I (RH124).\nRed Hat System Administration II (RH134).\n__________________________________________________________",
  "job_description": "Server-Side Development\t- Design, develop, and maintain server-side applications and microservices using chosen technologies (e.g., Node.js, Python/Django, Java/Spring Boot).\r\n- Build, integrate, and manage RESTful or GraphQL APIs for use by frontend and mobile applications.\r\n- Implement business logic and complex workflows on the server.\r\nDatabase Management\t- Design and optimize database schemas (SQL like PostgreSQL, MySQL, or NoSQL like MongoDB, Cassandra).\r\n- Ensure data integrity, security, and optimal query performance.\r\nSystem Architecture & Scalability\t- Design and implement scalable and high-performance systems to handle high traffic and data volume.\r\n- Implement caching mechanisms (e.g., Redis) to improve application speed and efficiency.\r\n- Manage and implement authentication and authorization mechanisms (e.g., JWT, OAuth) for secure applications.\r\nTesting, Quality, and Operations\t- Write unit, integration, and end-to-end tests to ensure code quality and system reliability.\r\n- Participate in code reviews to maintain coding standards and system health.\r\n- Debug, troubleshoot, and resolve complex production issues and bugs.\r\n- Collaborate with DevOps teams to deploy, monitor, and maintain services in cloud environments (e.g., AWS, GCP, Azure).\r\nCollaboration & Documentation\t- Work closely with frontend developers and mobile developers to define and integrate APIs.\r\n- Collaborate with product managers and designers to translate requirements into technical specifications.\r\n- Maintain clear, up-to-date API and system documentation.",
  "statistics": {
    "total_characters": 3899,
    "word_count": 505,
    "line_count": 72
  },
  "file_info": {
    "filename": "CV Mohamed Ali.pdf",
    "file_size_bytes": 440527,
    "extracted_text_length": 3899
  }
}